import 'package:cstarimage_testpage/constants/questions.dart';
import 'package:cstarimage_testpage/model/questions_answers_data.dart';

import '../constants/data_contants.dart';
import '../model/lecture_code.dart';

class EicImage extends QAndAData<List<Selections>> {

  EicImage({super.test = Test.eicImage}){
    // length = qEicImage.length;
    initiatedResultList();
  }

  // @override
  // final Test test = Test.eicImage;

  // @override
  // final List<String> questions = [
  //   '유행에 민감한 편이다.(음식, 패션, 물건 등) ',
  //   '첫 인상이 차갑다는 말을 많이 듣는 편이다 ',
  //   '쉽게 사람들과 친해지는 편이다 ',
  //   '나는 매력적(외모, 성격 다 포함)이다 ',
  //   '친근하고 푸근한 인상을 가졌다 ',
  //   '나만의 사상(신념)이 있다 ',
  //   '어딜 가도 눈에 튄다.(튄다는 소리를 많이 듣는 편) ',
  //   '사람들과 어울리는 것이 조금은 어렵다 ',
  //   '사람들을 잘 챙기는 편이다 ',
  //   '사람들에게서 주목받는 것을 즐긴다 ',
  //   '매너가 좋다 ',
  //   '침착하고 차분하다 ',
  //   '평화주의자이다.(웬만하면 져준다) ',
  //   '실용성보다는 디자인이다 ',
  //   '인정욕구가 강하다 ',
  //   '애교가 있다 ',
  //   '인내심이 많다 ',
  //   '평소에 옷 잘 입는다는 소리를 종종 듣는다 ',
  //   '새로운 무언가를 도전하는 것이 좋다 ',
  //   '물건마다 의미가 있어서 선뜻 잘 버리지 못 한다 ',
  //   '덜렁거린다 ',
  //   '완벽주의자이다 ',
  //   '친절하다 ',
  //   '다방면에 호기심이 많다 ',
  //   '논리적이다 ',
  //   '(나와 가까운)사람들과 있을 때 안정감을 느낀다 ',
  //   '예쁘고 아기자기한 것에 시선이 끌린다 ',
  //   '튀는 것은 딱 질색이다.(무난한 것 추구) ',
  //   '"내 자리는 항상 정리가 잘 되어 있다.(집, 사무실) ',
  //   '사람을 만나는 것을 즐긴다 ',
  //   '혼자가 편하다 ',
  //   '외로움을 많이 타는 편이다 ',
  //   '꾸미는 것에 관심이 많다 ',
  //   '감성 보다는 이성적이다 ',
  //   '경험주의이다 ',
  //   '언제나 자신감이 넘친다 ',
  //   '늘 입던 것, 가던 곳 익숙한 것이 마음이 편하다 ',
  //   '곧 죽어도 바른 말은 해야 된다 ',
  //   '눈썰미가 좋다 ',
  //   '맺고 끊는 것이 정확하다 ',
  //   '이해와 배려심이 많다 ',
  //   '무엇이든 배우는 것을 좋아 한다.(도전정신) ',
  //   '힘들고 지쳐도 티내지 않는다 ',
  //   '낯을 가린는 편이다 ',
  //   '즉흥적이다 ',
  //   '사람(눈썰미) 보는 눈이 좋다 ',
  //   '유머(재치)가 있다.(말을 잘하는 편) ',
  //   '사람들은 대체로 나를 편하게 생각하는 편이다 ',
  //   '계획적인 것이 좋다 ',
  //   '싫증을 잘 낸다.(잘 질린다) ',
  //   '목표지향적이다 ',
  // ];
  //
  // @override
  // final List<String> answers = [
  //   '예 ',
  //   '아니요 ',
  // ];


}
