class Answers {
  final List<String> aColorDisposition = [
    '예',
    '아니요',
  ];
  final List<List<String>> aDispositionTest = [
    [
      '친구들에게 연락해서 만난다 ',
      '혼자 여가(영화, 취미 등)생활을 즐긴다 ',
      '집에 가서 조용히 쉰다 ',
    ],
    [
      '먼저 다가가서 말을 건다 ',
      '눈치보다 말을 건넨다 ',
      '상대방이 말을 걸지 않으면 굳이 먼저 말을 하지 않는다 ',
    ],
    [
      '같이 떠날 친구를 구해 같이 떠난다 ',
      '혼자 조용히 떠난다 ',
      '티켓을 양도하거나 판다 ',
    ],
    [
      '대중의 시선을 즐긴다 ',
      '상황에 따라 나선다 ',
      '그저 숨고 싶다 ',
    ],
    [
      '친절하게 목적지까지 안내해준다 ',
      '(근처일 때),대충 설명해준다 ',
      '아임 쏘리, 아이 돈 노 잉글리쉬 ',
    ],
    [
      '반갑다 ',
      '지켜본다.(중립적 자세) ',
      '관심 없다 ',
    ],
    [
      '싫다 ',
      '혼자 있다가 나중엔 친구들과 어울린다 ',
      '반드시 필요하다 ',
    ],
    [
      '무슨 대화인지 궁금해서 물어본다 ',
      '대화가 끝날 때 까지 기다린다 ',
      '별 관심 없다 ',
    ],
    [
      '사람들과 함께 일하는 것이 좋다 ',
      '때에 따라 함께 하는 것도 나쁘진 않다 ',
      '혼자 일하는 것이 편하다 ',
    ],
    [
      '무조건 들어준다 ',
      '고민한다 ',
      '상황에 따라 거절한다 ',
    ],
    [
      '간다 ',
      '고민하다 친구와 동행한다 ',
      '안간다 ',
    ],
    [
      '지인들에게 바로 조언을 구한다 ',
      '혼자 해결하려고 하지만, 결국 지인들에게 물어본다 ',
      '혼자 알아서 해결한다 ',
    ],
    [
      '사람들과 어울릴 수 있는 곳이 좋다 ',
      '부분적으로 사람들과 어울릴 수 있는 세미패키지를 선택한다 ',
      '사람이 없는 조용한 곳이 좋다 ',
    ],
    [
      '여러 방면으로 두루두루 많다 ',
      '부분적으로 관심을 가진다 ',
      '새로운 흥밋거리 보단 하나만 판다 ',
    ],
    [
      '관계 지향적 ',
      '목표 지향적 ',
    ],
    [
      '즉흥적인 분위기파 ',
      '계획적인 스케줄러 ',
    ],
    [
      '오늘 하루 보고, 듣고, 느낀 것(feeling) ',
      '오늘 하루 진행 했던 것(doing) ',
    ],
    [
      '무계획 여행 ',
      '계획중심 여행 ',
    ],
    [
      '행동 후 사고 ',
      '사고 후 행동 ',
    ],
    [
      '감성적 위로 ',
      '현실적 조언 ',
    ],
    [
      '사람들과 프로젝트 과정중심 ',
      '사람들과 프로젝트 결과중심 ',
    ],
    [
      '진심어린 따뜻한 손편지 ',
      '스킨십 등,물질적 보상 ',
    ],
    [
      '시집, 소설, 감동실화 등 ',
      '에세이, 자기개발서, 추리 등 ',
    ],
    [
      '배려, 공감하는 이해력 ',
      '객관적인 사고논리력 ',
    ],
    [
      '인성중심 ',
      '능력중심 ',
    ],
    [
      '미래 지향적 ',
      '현재(현실)중심적 ',
    ],
    [
      '결국 남는 건 사람 ',
      '결국 남는 건 일(물질) ',
    ],
    [
      '감정파악(동감) ',
      '심리분석(데이터베이스) ',
    ],
    [
      '내가 느꼈던 감정 ',
      '내가 했던 행동 ',
    ],
  ];
  final List<String> aEicImage = [
    '예 ',
    '아니요 ',
  ];
  final List<String> aLeadershipQuestions = [
    '전혀 아니다 ',
    '대체로 아니다 ',
    '보통이다 ',
    '대체로 그렇다 ',
    '매우 그렇다 ',
  ];
  final List<List<String>> aPersonalColorSelfTest = [
    [
      '노란기가 많음 ',
      '노란기, 붉은기, 모두 동반 ',
      '붉은기가 많음 ',
    ],
    [
      '햇볕에 노출되면 그대로 타버리고 다시 원래의 피부로 돌아가는 시간이 오래 걸림 ',
      '때에 따라 다름 ',
      '햇빛에 노출되면 새빨갛게 붉어졌다가 다시 본연의 피부로 돌아감 ',
    ],
    [
      '베이지 & 옐로우 ',
      '모르겠음 ',
      '핑크, 붉은기 ',
    ],
    [
      '베이지와 아이보리 셔츠가 더 잘 어울림 ',
      '모르겠음 ',
      '순백색의 셔츠가 더 잘 어울림 ',
    ],
    [
      '내추럴 브라운 Or 딥 브라운 ',
      '모르겠음 ',
      '그레이 브라운 (회갈색) or 내추럭 블랙 ',
    ],
    [
      '내추럴 브라운 ',
      '딥 브라운 ',
      '내추럴 블랙 ',
    ],
    [
      '청녹색 ',
      '청녹색 & 청보라 ',
      '청보라 (파랑) ',
    ],
    [
      '오렌지, 드라이로즈, 코랄 ',
      '모르겠음 ',
      '핑크, 체리레드, 마젠타 ',
    ],
    [
      '골드 ',
      '로즈골드 ',
      '실버 ',
    ],
  ];

// List<String> aPitr = [];
  final List<String> aSelfEsteemQuestions = [
    '아니다 ',
    '보통이다 ',
    '그렇다 ',
    '매우 그렇다 ',
  ];
  final List<List<String>> aStressResponseQuestions = [
    [
      '그만하라고 주의를 준다 ',
      '다른 주제로 은근슬쩍 이야기를 돌린다 ',
      '들어주는 척 딴 짓을 한다 ',
      '귀 닫고 아무 말 안한다 ',
    ],
    [
      '적극적으로 도와준다 ',
      '부분적으로 도와준다 ',
      '개선점만 이야기 하고 본인이 해결할 문제 ',
      '내 일만 한다 ',
    ],
    [
      '소신 있게 내 의견을 어필한다 ',
      '반응을 보면서 설득한다 ',
      '생각할 시간을 가지고 다시 회의 한다 ',
      '상대방의 의견을 전적으로 따른다 ',
    ],
    [
      '찾아가서 이유를 물어본다 ',
      '주변 사람들과 뒷담화한 사람을 뒷담 ',
      '내가 무슨 잘못을 했는지 생각해 본다 ',
      '모른 척 그냥 지나간다 ',
    ],
    [
      '즉시 해명을 촉구한다 ',
      '앞에선 말 못하고 사람들에게 조언을 구한다 ',
      '말할까 말까 고민한다 ',
      '그러려니 넘어간다 ',
    ],
    [
      '아닌건 아니라고 말한다 ',
      '누군가가 뭐라 해주길 기다린다 ',
      '나도 저런 사람인가 생각해 본다 ',
      '일단 지켜본다 ',
    ],
    [
      '맛없다고 대놓고 말한다 ',
      '맛 없었다고 연인이 아닌 친구들에게 말한다 ',
      '맛 있다고 억지로 말해준다 ',
      '아무 말을 못한다. (표정관리X ',
    ],
    [
      '다음엔 물어보고 구매하라고 말한다 ',
      '필요한 누군가에게 준다 ',
      '원래 가지고 싶었던 거라고 거짓말 한다 ',
      '어딘가에 방치한다 ',
    ],
    [
      '선약이 있다고 하얀 거짓말을 한다 ',
      '계속 다음으로 미룬다 ',
      '일단 만나본다 ',
      '안읽씹(며칠 답을 안한다. ',
    ],
    [
      '당사자에게 기분 나쁘다고 말한다 ',
      '말은 못하고 기분만 나빠하다 주변사람들에게 말한다 ',
      '혹시 무슨 일 있는 것은 아닌가 걱정한다 ',
      '바빠서 그런가보다 생각한다 ',
    ],
    [
      '내가 먹고 싶은 것을 자유롭게 말한다 ',
      '메뉴 상관없이 친한 사람들과 먹고 싶다 ',
      '아무거나 먹는다 ',
      '혼밥 한다 ',
    ],
    [
      '편한 사람들에게(가족 등) 화풀이 한다 ',
      '사람들에게 내 감정을 공유 ',
      '음주, 폭식, 단식, 취미생활 등 ',
      '아무것도 하지 않고 혼자 있고 싶다 ',
    ],
    [
      '듣기 싫다고 반박한다 ',
      '자리를 뜬다 ',
      '들을 수 있을 만큼 들어본다 ',
      '대놓고 딴 짓한다 ',
    ],
    [
      '괘씸하다. (어떻게 할지 추후 생각해본다) ',
      '마음이 상했지만 적당한 관계를 유지한다 ',
      '이유가 있다고 생각하려 애쓴다 ',
      '더 이상 연락 안한다 ',
    ],
    [
      '바로 거절한다 ',
      '그래도 어느 정도 빌려준다 ',
      '고민해 본다 ',
      '잠수 탄다 ',
    ],
    [
      '다음에 듣는다 ',
      '내 상황을 말한다 ',
      '그래도 들어본다 ',
      '핸드폰을 아에 보지 않는다 ',
    ],
    [
      '즉시 뭐라 한다 ',
      '불편한 기색을 주변 친구들한테 티낸다 ',
      '내가 만만한가 생각한다 ',
      '말없이 연을 끊는다.(차단) ',
    ],
    [
      '안 친해도 상황이 되는 사람들과 같이 간다 ',
      '무조건 친한 사람들과 함꼐 간다 ',
      '혼자 갈지 친구들과 함꼐 갈지 생각해 본다 ',
      '혼자 간다 ',
    ],
  ];
}
